Catalogs/NomenclaturePackages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>NomenclaturePackages</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.NomenclatureCategories</xr:Item>
				<xr:Item>Catalog.Nomenclature</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConversionFactor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/NomenclaturePropertyAssignmentLevel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>NomenclaturePropertyAssignmentLevel</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DoNotUse</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NomenclatureCategoryLevel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NomenclatureItemLevel</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/NomenclaturePackages/Forms/ListForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	If Parameters.Property("Filter") AND Parameters.Filter.Property("Owner") Then

		Owner       = Parameters.Filter.Owner;
		FilterOwner = Undefined;

		If TypeOf(Owner) = Type("CatalogRef.Nomenclature") Then

			If Owner.Category.PackageUse = Enums.NomenclaturePropertyAssignmentLevel.NomenclatureItemLevel Then
				FilterOwner = Owner;
			ElsIf Owner.Category.PackageUse = Enums.NomenclaturePropertyAssignmentLevel.NomenclatureCategoryLevel Then
				FilterOwner = Owner.Category;
			EndIf;

		ElsIf TypeOf(Owner) = Type("CatalogRef.NomenclatureCategories") Then

			If Owner.PackageUse = Enums.NomenclaturePropertyAssignmentLevel.NomenclatureCategoryLevel Then
				FilterOwner = Owner;
			EndIf;

		EndIf;

		If FilterOwner = Undefined Then

			TitleText = NStr("en = 'Item ""%Owner%"" does not use packages'; ru = 'Для элемента: ""%Owner%"" упаковки не используются'");
			TitleText = StrReplace(TitleText, "%Owner%", String(Owner));

			AutoTitle = False;
			Title     = TitleText;

			Items.List.ReadOnly = True;

		EndIf;

		Parameters.Filter.Owner = FilterOwner;

	EndIf;

EndProcedure
